doc: use mermaid
